llm/benchmark_results/20251028_113904/structured_regex/results_regex.txt
INFO 10-28 04:47:25 [__init__.py:216] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='https://dotieuthien--example-vllm-openai-compatible-serve.modal.run', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset='regex', json_schema_path=None, max_concurrency=None, model='Qwen/Qwen2.5-VL-7B-Instruct-AWQ', tokenizer=None, tokenizer_mode='auto', num_prompts=100, output_len=128, request_rate=10.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_results=False, profile=False, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, no_structured_output=False, structured_output_ratio=1.0)
Input length of the prompt: 35 tokens
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           10.00     
Benchmark duration (s):                  34.72     
Total input tokens:                      3500      
Total generated tokens:                  12800     
Request throughput (req/s):              2.88      
Output token throughput (tok/s):         368.69    
Total Token throughput (tok/s):          469.50    
---------------Time to First Token----------------
Mean TTFT (ms):                          12252.68  
Median TTFT (ms):                        14078.71  
P99 TTFT (ms):                           21219.86  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.87     
Median TPOT (ms):                        34.12     
P99 TPOT (ms):                           44.29     
---------------Inter-token Latency----------------
Mean ITL (ms):                           35.06     
Median ITL (ms):                         0.01      
P99 ITL (ms):                            422.12    
==================================================
correct_rate(%) 0.0 



=== STDERR ===

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:06<09:55,  6.02s/it]
  3%|▎         | 3/100 [00:06<02:35,  1.60s/it]
  5%|▌         | 5/100 [00:06<01:20,  1.18it/s]
  7%|▋         | 7/100 [00:07<01:03,  1.46it/s]
  8%|▊         | 8/100 [00:07<00:58,  1.57it/s]
  9%|▉         | 9/100 [00:08<00:51,  1.78it/s]
 10%|█         | 10/100 [00:08<00:40,  2.24it/s]
 11%|█         | 11/100 [00:09<00:50,  1.77it/s]
 12%|█▏        | 12/100 [00:10<00:57,  1.54it/s]
 13%|█▎        | 13/100 [00:10<00:44,  1.94it/s]
 14%|█▍        | 14/100 [00:10<00:41,  2.06it/s]
 15%|█▌        | 15/100 [00:10<00:34,  2.45it/s]
 16%|█▌        | 16/100 [00:11<00:39,  2.10it/s]
 17%|█▋        | 17/100 [00:11<00:40,  2.07it/s]
 19%|█▉        | 19/100 [00:12<00:23,  3.41it/s]
 20%|██        | 20/100 [00:12<00:25,  3.14it/s]
 21%|██        | 21/100 [00:12<00:22,  3.47it/s]
 22%|██▏       | 22/100 [00:13<00:30,  2.56it/s]
 23%|██▎       | 23/100 [00:13<00:23,  3.22it/s]
 24%|██▍       | 24/100 [00:14<00:30,  2.48it/s]
 25%|██▌       | 25/100 [00:14<00:24,  3.08it/s]
 26%|██▌       | 26/100 [00:15<00:38,  1.94it/s]
 27%|██▋       | 27/100 [00:15<00:28,  2.53it/s]
 28%|██▊       | 28/100 [00:16<00:49,  1.45it/s]
 29%|██▉       | 29/100 [00:17<00:51,  1.37it/s]
 30%|███       | 30/100 [00:17<00:44,  1.58it/s]
 31%|███       | 31/100 [00:18<00:36,  1.89it/s]
 32%|███▏      | 32/100 [00:18<00:29,  2.34it/s]
 33%|███▎      | 33/100 [00:18<00:23,  2.84it/s]
 34%|███▍      | 34/100 [00:18<00:18,  3.56it/s]
 35%|███▌      | 35/100 [00:19<00:21,  3.00it/s]
 37%|███▋      | 37/100 [00:19<00:14,  4.23it/s]
 39%|███▉      | 39/100 [00:19<00:12,  4.99it/s]
 40%|████      | 40/100 [00:20<00:16,  3.71it/s]
 41%|████      | 41/100 [00:20<00:14,  3.95it/s]
 42%|████▏     | 42/100 [00:20<00:18,  3.09it/s]
 43%|████▎     | 43/100 [00:21<00:26,  2.15it/s]
 44%|████▍     | 44/100 [00:21<00:21,  2.64it/s]
 46%|████▌     | 46/100 [00:22<00:18,  3.00it/s]
 48%|████▊     | 48/100 [00:23<00:22,  2.30it/s]
 49%|████▉     | 49/100 [00:24<00:22,  2.30it/s]
 50%|█████     | 50/100 [00:24<00:17,  2.78it/s]
 53%|█████▎    | 53/100 [00:24<00:09,  5.06it/s]
 56%|█████▌    | 56/100 [00:24<00:06,  7.33it/s]
 58%|█████▊    | 58/100 [00:24<00:05,  7.14it/s]
 60%|██████    | 60/100 [00:25<00:05,  7.54it/s]
 62%|██████▏   | 62/100 [00:25<00:07,  5.24it/s]
 63%|██████▎   | 63/100 [00:25<00:06,  5.45it/s]
 64%|██████▍   | 64/100 [00:26<00:07,  4.63it/s]
 65%|██████▌   | 65/100 [00:26<00:07,  4.89it/s]
 67%|██████▋   | 67/100 [00:26<00:05,  5.90it/s]
 69%|██████▉   | 69/100 [00:26<00:04,  6.94it/s]
 70%|███████   | 70/100 [00:27<00:08,  3.39it/s]
 71%|███████   | 71/100 [00:28<00:09,  3.10it/s]
 72%|███████▏  | 72/100 [00:28<00:09,  3.02it/s]
 73%|███████▎  | 73/100 [00:28<00:07,  3.56it/s]
 76%|███████▌  | 76/100 [00:28<00:03,  6.59it/s]
 78%|███████▊  | 78/100 [00:29<00:03,  6.29it/s]
 80%|████████  | 80/100 [00:29<00:05,  3.92it/s]
 81%|████████  | 81/100 [00:30<00:07,  2.58it/s]
 82%|████████▏ | 82/100 [00:31<00:06,  2.66it/s]
 85%|████████▌ | 85/100 [00:31<00:03,  4.47it/s]
 86%|████████▌ | 86/100 [00:32<00:04,  3.37it/s]
 87%|████████▋ | 87/100 [00:32<00:03,  3.68it/s]
 88%|████████▊ | 88/100 [00:32<00:03,  3.36it/s]
 89%|████████▉ | 89/100 [00:32<00:03,  3.14it/s]
 90%|█████████ | 90/100 [00:33<00:03,  3.08it/s]
 93%|█████████▎| 93/100 [00:33<00:01,  5.49it/s]
 95%|█████████▌| 95/100 [00:33<00:00,  5.58it/s]
 98%|█████████▊| 98/100 [00:34<00:00,  7.67it/s]
100%|██████████| 100/100 [00:34<00:00,  5.18it/s]
100%|██████████| 100/100 [00:34<00:00,  2.88it/s]